app/views/patients/show.html.erb

SELECT "caregivers".* FROM "caregivers" WHERE "caregivers"."patient_id" = ?  [["patient_id", 1]]
---
<p> Caregivers </p>
  <% @patient.caregivers.each do |caregiver| %>