app/controllers/caregivers_controller.rb

INSERT INTO "caregivers" ("first_name", "last_name", "email", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "ji"], ["last_name", "ji"], ["email", "ji@d.com"], ["patient_id", 1], ["created_at", "2015-11-08 15:46:09.267648"], ["updated_at", "2015-11-08 15:46:09.267648"]]
---
  def create
  	@caregiver = @patient.caregivers.build(caregiver_params)

  	if @caregiver.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
	def load_patient
	@patient = Patient.find(params[:patient_id])