app/controllers/clinicians_controller.rb

SELECT "clinicians".* FROM "clinicians"
---
  def index
    @clinicians = Clinician.all

SELECT  "clinicians".* FROM "clinicians" WHERE "clinicians"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @clinician = Clinician.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "cates.jill@gmail.com"]]
INSERT INTO "clinicians" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Jill"], ["last_name", "Cates"], ["created_at", "2015-11-08 18:22:28.568814"], ["updated_at", "2015-11-08 18:22:28.568814"]]
INSERT INTO "users" ("email", "encrypted_password", "profile_id", "profile_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @clinician = Clinician.new(clinician_params)
    @user_finder = User.find_by_email(params[:email])

    respond_to do |format|
      if @user_finder.nil?
        @clinician.save
        User.create(email: params[:email], password: params[:password], password_confirmation: params[:password], profile: @clinician)

SELECT  "clinicians".* FROM "clinicians" WHERE "clinicians"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_clinician
      @clinician = Clinician.find(params[:id])