app/controllers/medications_controller.rb

  def create
    @medication = Medication.new(medication_params)

    if @medication.save
---
INSERT INTO "medications" ("name", "description", "dosage_in_milligrams", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asda"], ["description", "asda"], ["dosage_in_milligrams", 100.0], ["created_at", "2015-11-08 18:58:10.079829"], ["updated_at", "2015-11-08 18:58:10.079829"]]