app/controllers/patients_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@test.com"]]
INSERT INTO "patients" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "jilll"], ["last_name", "cates"], ["created_at", "2015-11-08 15:35:07.282093"], ["updated_at", "2015-11-08 15:35:07.282093"]]
INSERT INTO "users" ("email", "encrypted_password", "profile_id", "profile_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @patient = Patient.new(patient_params)
    @user_finder = User.find_by_email(params[:email])

    respond_to do |format|
      if @user_finder.nil?
        @patient.save
        User.create(email: params[:email], password: params[:password], password_confirmation: params[:password], profile: @patient)