app/controllers/schedules_controller.rb

	def create
		@schedule = Schedule.new(schedule_params)
		if @schedule.save
---
INSERT INTO "schedules" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2015-11-08 00:42:50.298701"], ["updated_at", "2015-11-08 00:42:50.298701"]]

	def show
		@schedule = Schedule.find(params[:id])
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", 1]]